package pro.azhidkov.mariotte.domain.rooms

import com.fasterxml.jackson.annotation.JsonValue


/**
 * Доменное перечисление "Тип номера" (объект-значение).
 *
 * В данном случае я делаю предположение, что набор типов номеров фиксирован
 * и пользователям не требуется возможность изменять состав значений перечисления.
 *
 * Метки в коде:
 * 1. Эта аннотация приводит к тому, что Jackson (де)сериализует поля типа RoomType в виде числа с идентификатором,
 *    а не строки с названием варианта перечисления.
 *    Это, в свою очередь, повышает "эволюционируемость" API: в моей практике были прецеденты, когда
 *    бизнес менял состав и имена вариантов перечисления, а они фигурировали в API и мне пришлось
 *    прикладывать значительные усилия, чтобы оставить код синхронизованным с языком бизнеса и
 *    при этом не сломать обратную совместимость.
 */
enum class RoomType(
    @JsonValue // 1
    val id: Int
) {

    LUX(1),
    SEMI_LUX(2);

}
